nuclei-v3/S/sap-getenvironment-disclosure.yaml

http:
- matchers:
  - part: body
    type: word
    words:
    - GetEnvironmentResponse
  - condition: and
    part: body
    type: word
    words:
    - LOGNAME=
    - USER=
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:GetEnvironment xmlns:ns1=\"urn:SAPControl\"/>\n \
    \ </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n"
id: sap-getenvironment-disclosure
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAP Start Service (sapstartsrv) SAPControl
    SOAP web service exposes the GetEnvironment web method without authentication.

    '
  metadata:
    max-request: 1
  name: SAPControl GetEnvironment - Disclosure
  reference:
  - https://help.sap.com/docs/SUPPORT_CONTENT/si/3362959700.html
  - https://itsiti.com/csmon/
  - https://docs.avantra.com/api/latest/js/sap-control.html
  severity: medium
  tags: misconfig,sap,soap,env,exposure
